# 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Учтите, что числа могут быть отрицательными.
# Пример:
# 67.82 -> 23
# (-0.56) -> 11


num = list(input('Enter value for number: '))
summ = 0
for i in num:
    if i.isdigit():
        summ += int(i)
print(summ)