# 3. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N

n = int(input('Enter value of N: '))
print(*range(-n, n + 1), sep=', ')

